using FuzzySharp;
using JuTCo.Text.Review.Contracts;
using JuTCo.Text.Review.Extensions;

namespace JuTCo.Text.Review.Detectors;

/// <summary>
///     Детектор канцелярита (канцелярских слов)
/// </summary>
internal class ChancelleryDetector : IDetector
{
    private const int _weight = 100;
    private const string _name = "Канцеляризм";

    private const string _description =
        "Канцеляризмы утяжеляют текст и его становится тяжелее прочитать людям не знающие терминологии. Лучше попробуйте заменить на синонимы: {0}";

    private const string _shortDescription =
        "Проверьте, стоит ли использовать данный термин или стоит заменить на более понятный синоним";

    private const string _color = "blue";
    private const string _tab = "red";

    private static readonly IDictionary<string, string[]> _dictionary = new Dictionary<string, string[]>
    {
        {
            "абсолютно",
            [
                "совсем", "совершенно", "полностью", "сплошь", "насквозь", "решительно", "начисто", "напрочь",
                "всецело", "вдребезги", "вконец", "радикально", "безусловно", "подчистую", "в корне", "целиком"
            ]
        },
        { "абсцесс", ["воспаление", "нарыв", "гнойник", "язва", "фурункул", "чирей"] },
        { "альтернативный", ["другой", "иной", "еще один", "дополнительный", "противоположный"] },
        { "амортизировать", ["смягчить", "ослабить", "сгладить", "умерить"] },
        { "аморфный", ["бесформенный", "неопределённый", "рыхлый", "расплывчатый"] },
        {
            "анализировать",
            [
                "раскладывать по полочкам", "разбирать по косточкам", "размышлять", "прикидывать", "рассуждать",
                "проводить разбор полётов"
            ]
        },
        {
            "аналогично",
            [
                "так же", "точно так же", "таким же образом", "таким же макаром", "в том же духе", "в том же ключе",
                "в том же роде", "на такой же манер", "в ту же кассу", "похоже", "подобно", "схоже", "близко", "сродни",
                "по образу и подобию", "такого же порядка", "того же типа", "того же склада", "одинаково",
                "одной природы", "точь-в-точь"
            ]
        },
        { "апеллировать", ["обращаться", "жаловаться", "просить", "взывать"] },
        { "апробировать", ["пробовать", "испытывать", "проверять"] },
        {
            "безапелляционно",
            [
                "твердо", "категорически", "однозначно", "решительно", "без вариантов", "наотрез",
                "не допуская возражений"
            ]
        },
        { "девальвировать", ["обесценивать"] },
        {
            "дезориентированный",
            ["запутавшийся", "потерявшийся", "заблудившийся", "сбитый с толку", "сбитый с панталыку"]
        },
        { "демпфировать", ["см. «амортизировать»"] },
        { "дилемма", ["выбор", "одно из двух", "задача", "вопрос", "вопрос ребром", "проблема"] },
        { "дискутировать", ["спорить", "обсуждать", "разговаривать", "вести дебаты"] },
        {
            "диссонанс",
            ["расхождение", "разлад", "нестыковка", "разногласие", "противоречие", "несоответствие"]
        },
        {
            "игнорировать",
            [
                "не замечать", "пропускать мимо ушей", "не слышать", "не видеть",
                "плюнуть/наплевать на (что-то, кого-то)", "махнуть рукой", "презирать", "забить", "пренебрегать",
                "не обращать внимания", "переступить", "попрать", "презреть", "начихать", "манкировать", "саботировать",
                "бойкотировать", "воротить нос", "закрывать глаза", "и ухом не вести", "не замечать",
                "сбрасывать со счетов", "не желать знать"
            ]
        },
        { "идентично", ["см. «аналогично»"] },
        {
            "инаугурация",
            ["вступление в должность", "посвящение", "взятие на себя полномочий", "церемония"]
        },
        {
            "индивидуальный",
            [
                "особенный", "особый", "личный", "личностный", "свой", "собственный", "специальный", "отдельный",
                "характерный", "своеобразный", "оригинальный", "частный", "по-своему", "специфический", "неповторимый",
                "самобытный", "штучный", "неизбитый", "каждому свой", "порознь взятый", "уникальный"
            ]
        },
        {
            "индульгенция",
            ["отпущение грехов", "вольная", "освобождение", "свобода", "милость", "прощение"]
        },
        {
            "иррационально",
            [
                "непостижимо", "непознаваемо", "непонятно", "нелогично", "вне логики", "непредсказуемо", "интуитивно",
                "в порыве", "не оценивая", "импульсивно"
            ]
        },
        { "канцерогенный", ["вредный", "ядовитый", "опасный"] },
        { "катализатор", ["ускоритель", "стимул", "толчок"] },
        {
            "квази-",
            [
                "как бы", "вроде", "нечто вроде", "как будто", "почти", "псевдо-", "лже-", "мнимый", "ложный", "якобы",
                "будто бы", "ненастоящий"
            ]
        },
        {
            "квинтэссенция",
            [
                "суть", "сущность", "сухой осадок", "экстракт", "соль", "красная нить", "главная идея/мысль", "основа",
                "основное"
            ]
        },
        {
            "компенсация",
            [
                "покрытие", "возмещение", "восполнение", "выплата", "вознаграждение", "по заслугам",
                "всем сестрам по серьгам"
            ]
        },
        { "компиляция", ["компоновка", "составление", "сборная солянка", "набор"] },
        { "конвертировать", ["преобразовать", "обратить", "изменить", "поменять"] },
        {
            "конгломерат",
            [
                "собрание", "соединение", "объединение", "единство", "группа", "набор", "организация", "структура",
                "сообщество"
            ]
        },
        {
            "конфиденциально",
            [
                "секретно", "тайно", "скрытно", "доверительно", "тет-а-тет", "по секрету", "на ухо", "между нами",
                "негласно", "не для чужих ушей"
            ]
        },
        {
            "конфронтация",
            [
                "столкновение", "противостояние", "противоборство", "противопоставление", "конфликт", "стычка", "ссора",
                "бой"
            ]
        },
        {
            "концентрироваться",
            ["собираться", "сосредотачиваться", "сгущаться", "скапливаться", "насыщаться"]
        },
        {
            "концепция",
            [
                "идея", "теория", "мысль", "учение", "доктрина", "система", "положение", "план", "представление",
                "замысел", "задумка", "тезис"
            ]
        },
        {
            "координировать",
            [
                "управлять", "регулировать", "руководить", "связывать", "организовывать", "устанавливать",
                "согласовывать"
            ]
        },
        {
            "коучер",
            ["учитель", "тренер", "консультант", "помощник", "наставник", "преподаватель", "гуру", "сенсей"]
        },
        { "легитимность", ["законность", "правомочность", "правомерность", "легальность"] },
        {
            "ментальность",
            [
                "ум", "склад ума", "образ мыслей", "философия", "видение", "воззрение", "идеология", "миропонимание",
                "взгляд на вещи", "взгляд на жизнь"
            ]
        },
        { "миграция", ["перемещение", "переселение", "переезд", "передвижение"] },
        { "милитаристический", ["военный", "военизированный", "цвета хаки"] },
        {
            "мимикрировать",
            [
                "маскироваться", "притворяться", "прикидываться", "сливаться",
                "изображать/строить/корчить/разыгрывать из себя", "симулировать", "надеть камуфляж", "надеть личину",
                "обернуться"
            ]
        },
        {
            "оппозиция",
            [
                "враг", "соперник", "неприятель", "недруг", "сопротивление", "противостояние", "противодействие",
                "другая сторона"
            ]
        },
        {
            "оппортунист",
            [
                "приспособленец", "хамелеон", "изменник", "соглашатель", "лицемер", "служит и нашим и вашим",
                "служит на два лагеря", "вьётся ужом", "беспринципный", "двуликий", "перебежчик"
            ]
        },
        {
            "ориентироваться",
            [
                "понимать", "разбираться", "соображать", "определять", "смыслить", "нацеливаться", "смекать", "сечь",
                "просекать", "быть знатоком/экспертом/профи", "быть на «ты»", "знать все ходы и выходы",
                "знать что к чему", "знать/понимать толк"
            ]
        },
        {
            "периодически",
            ["подчас", "время от времени", "временами", "иногда", "иной раз", "порой", "циклично", "регулярно"]
        },
        {
            "перфекционист",
            ["идеалист", "утопист", "мечтатель", "фантазёр", "педант", "господин совершенство"]
        },
        {
            "плюрализм",
            [
                "множество", "множественность", "богатство выбора", "богатство мнений", "многозначность",
                "разносторонность", "многосторонность", "многогранность"
            ]
        },
        {
            "позиционировать",
            [
                "обозначать", "представлять", "размещать", "располагать", "определять", "показывать",
                "создавать впечатление", "преподносить", "давать понять"
            ]
        },
        { "полемизировать", ["см. «дискутировать»"] },
        {
            "прагматик",
            ["практичный", "приземленный", "осторожный", "скептик", "материалист", "логик", "циник"]
        },
        {
            "презентабельный",
            [
                "важный", "солидный", "видный", "внушительный", "представительный", "импозантный", "сановитый",
                "достойный", "вызывающий доверие"
            ]
        },
        {
            "презентация",
            [
                "представление", "показ", "шоу", "действо", "мероприятие", "открытие", "предъявление", "демонстрация"
            ]
        },
        {
            "продуцировать",
            ["делать", "производить", "вырабатывать", "рождать", "изготовлять", "творить", "сочинять"]
        },
        {
            "профанация",
            [
                "искажение", "извращение", "ложь", "вранье", "спектакль", "фарс", "блеф", "неправда", "кощунство",
                "осквернение", "опошление", "надругательство", "оскорбление"
            ]
        },
        {
            "ратифицировать",
            ["принять", "одобрить", "подписать", "утвердить", "сделать правомочным", "укоренить"]
        },
        { "реабилитировать", ["восстановить", "излечить", "спасти", "вернуть честное имя"] },
        {
            "реагировать",
            [
                "отвечать", "отзываться", "откликаться", "чувствовать", "дать знать", "дать понять",
                "выказывать свое отношение/точку зрения/взгляд/мысли"
            ]
        },
        {
            "реанимировать",
            [
                "восстановить", "оживить", "воскресить", "вернуть", "вдохнуть жизнь (в кого-либо, во что-либо)",
                "починить", "отремонтировать", "переделать", "привести в чувство/сознание"
            ]
        },
        {
            "регламентированный",
            [
                "упорядоченный", "отрегулированный", "организованный", "дозволенный", "определенный",
                "согласно распорядку/расписанию/плану/инструкции", "по графику", "по плану", "оговоренный",
                "прописанный", "зафиксированный", "закрепленный"
            ]
        },
        { "редукция", ["ослабление", "снижение", "уменьшение", "упрощение", "понижение", "изъятие"] },
        {
            "реинкарнация",
            ["перевоплощение", "переселение", "возрождение", "перерождение", "бессмертие"]
        },
        {
            "рекреационный",
            [
                "восстановительный", "живительный", "возрождающий", "восстанавливающий", "воскрешающий", "обновляющий",
                "придающий сил", "воссоздающий", "поправляющий", "освежающий", "для отдыха"
            ]
        },
        {
            "ремиссия",
            ["ослабление", "снижение", "откат", "отказ", "освобождение", "возвращение", "исчезновение"]
        },
        {
            "репрезентативный",
            [
                "объективный", "надежный", "проверенный", "представительный", "типичный", "характерный",
                "показательный", "внушающий доверие"
            ]
        },
        { "реструктуризация", ["пересмотр", "изменение", "преобразование", "перестройка"] },
        {
            "рудиментарный",
            [
                "недоразвитый", "остаточный", "исчезающий", "зачаточный", "вымирающий", "отмирающий", "иссякающий",
                "неполноценный", "оставшийся", "пережиточный", "ущербный", "сохранившийся", "ненужный", "лишний",
                "бестолковый", "бесполезный", "незначимый"
            ]
        },
        {
            "санация",
            ["оздоровление", "очищение", "восстановление", "переустройство", "зачистка", "уборка"]
        },
        {
            "санкционировать",
            [
                "позволять", "допускать", "разрешать", "утверждать", "одобрять", "дозволять", "дать добро",
                "дать зеленый свет", "выдать карт-бланш", "дать возможность", "дать разрешение"
            ]
        },
        { "сатисфакция", ["удовлетворение", "удовольствие", "воздаяние", "возмездие", "возмещение"] },
        {
            "сегмент",
            [
                "блок", "клетка", "кусок", "отрезок", "раздел", "сектор", "секция", "участок", "часть", "элемент",
                "ячейка"
            ]
        },
        { "семантика", ["смысл", "значение", "соль"] },
        {
            "сентенция",
            [
                "мысль", "изречение", "нравоучение", "выражение", "игра слов", "мораль", "назидание", "наставление",
                "нотация", "проповедь", "речь", "слово", "суждение"
            ]
        },
        {
            "систематизировать",
            [
                "группировать", "разбирать", "приводить в порядок", "раскладывать по полочкам", "упорядочивать",
                "организовывать"
            ]
        },
        {
            "спорадически",
            [
                "случайно", "отдельно", "единично", "непостоянно", "подчас", "урывками", "иногда", "оазисами",
                "временами", "изредка", "иным часом", "кое-когда", "нечасто", "невзначай", "разово", "редко",
                "нехарактерно", "эпизодически", "от случая к случаю"
            ]
        },
        {
            "стагнация",
            [
                "спад", "застой", "упадок", "депрессия", "вялость", "глухая пора", "глухое время", "загнивание",
                "затишье", "конец", "кризис", "минор", "ослабление", "падение", "паралич", "понижение", "свёртывание",
                "схлопывание", "убывание", "убыток"
            ]
        },
        {
            "стандартный",
            [
                "обычный", "обыденный", "обыкновенный", "привычный", "простой", "безыскусный", "бесхитростный",
                "блёклый", "нормальный", "банальный", "типовой", "типичный", "штампованный", "шаблонный",
                "стереотипный", "трафаретный", "эталонный", "не блещущий новизной", "не блещущий оригинальностью",
                "неоригинальный", "затасканный", "заурядный", "избитый", "общеизвестный", "ординарный", "пошлый",
                "привычный", "примерный", "рутинный", "рядовой", "устойчивый", "устоявшийся"
            ]
        },
        { "структурировать", ["см. «систематизировать»"] },
        { "тривиальный", ["см. «стандартный»"] },
        { "унифицированный", ["одинаковый", "однообразный", "однородный", "типизированный"] },
        { "урбанистический", ["городской", "градской", "техногенный", "технократический"] },
        {
            "фактически",
            [
                "на деле", "на поверку", "на практике", "на самом деле", "без малого", "безусловно", "бесспорно",
                "в действительности", "в итоге", "в результате", "в сумме", "в сущности", "вправду", "впрямь",
                "документально", "де-факто", "если разобраться", "ей-же-ей", "по понятиям", "по сути", "по сути дела",
                "по существу", "очевидно", "поистине", "практически", "разумеется", "само собой", "собственно",
                "строго говоря", "совершенно", "точно", "чай", "чего греха таить", "явно"
            ]
        },
        {
            "флегматичный",
            [
                "бездушный", "безмятежный", "безразличный", "безучастный", "бесстрастный", "бесчувственный",
                "благодушный", "выдержанный", "вялый", "кислый", "квёлый", "ледяной", "ленивый", "лощеный", "медленный",
                "медлительный", "мертвенный", "мертвый", "невозмутимый", "неживой", "неизменный", "нерасторопный",
                "неспешный", "неторопливый", "покойный", "преспокойный", "равнодушный", "ровный", "сдержанный",
                "скупой", "спокойный", "тихий", "умеренный", "уравновешенный", "философский", "хладнокровный"
            ]
        },
        { "флуктуация", ["колебание", "отклонение", "случайное изменение", "случайное движение"] },
        {
            "форсировать",
            [
                "педалировать", "побуждать", "подгонять", "торопить", "ускорять", "приближать", "провоцировать",
                "разгонять", "стимулировать", "убыстрять", "увеличивать"
            ]
        },
        {
            "хронологически",
            ["последовательно", "по порядку", "по ходу времени", "поступательно", "шаг за шагом", "день за днем"]
        },
        {
            "эгоцентричный",
            [
                "амбициозный", "горделивый", "гордый", "самовлюбленный", "самолюбивый", "себялюбивый", "честолюбивый",
                "эгоистичный", "высокомерный", "гребущий под себя", "дующий в свою дуду"
            ]
        },
        {
            "эклектичный",
            [
                "сборный", "разностильный", "неоднородный", "разнородный", "пёстрый", "разноликий", "разнотипный",
                "слитный", "смешанный", "соединенный"
            ]
        },
        { "эксгумировать", ["извлекать", "доставать", "раскапывать", "вытаскивать"] },
        {
            "экстерьер",
            [
                "вид", "видок", "внешность", "облик", "дизайн", "лик", "наружность", "обличие", "обстановка", "образ",
                "убранство", "фасад", "формы"
            ]
        },
        {
            "экстраординарный",
            [
                "баснословный", "бесподобный", "беспримерный", "внештатный", "дикий", "диковинный", "исключительный",
                "казусный", "крутой", "небывалый", "невиданный", "неимоверный", "ненормальный", "необычайный",
                "необыкновенный", "необычный", "неординарный", "неповторимый", "неслыханный", "оригинальный",
                "особенный", "особый", "отличный", "поразительный", "причудливый", "редкий", "самобытный",
                "сверхъестественный", "сказочный", "странный", "феноменальный", "чрезвычайный", "чрезмерный",
                "чудаковатый", "чудный", "экзотический", "экстравагантный", "из ряда вон", "не поддающийся описанию",
                "не поддающийся сравнению", "каких свет не видывал", "другого такого не найти"
            ]
        },
        {
            "элементарно",
            [
                "просто", "легко", "очевидно", "естественно", "обыкновенно", "обычно", "банально", "скромно",
                "нетрудно", "избито", "примитивно", "непринужденно", "несложно", "нехитро", "буднично", "поверхностно",
                "пустяково", "бесхитростно", "незатейливо", "незамысловато", "простецки", "немудрёно", "неприхотливо",
                "хрестоматийно", "безыскусно", "схематично", "азбучно", "упрощенно", "вульгарно", "пошло", "пустяково",
                "затрапезно", "без затей", "без труда", "и к бабке не ходи", "и к гадалке не ходи",
                "не мудрствуя лукаво", "проще пареной репы", "само собой разумеется", "ясно как божий день",
                "яснее ясного", "и дураку ясно", "и слепому видно", "раз плюнуть"
            ]
        },
        {
            "экспатриация",
            [
                "изгнание", "высылка", "ссылка", "выселение", "переезд", "перекочевка", "перемещение", "переселение",
                "выпроваживание", "удаление", "эмиграция"
            ]
        },
        { "энтропия", ["беспорядок", "разлад", "бардак"] },
        {
            "энтузиазм",
            [
                "азарт", "бойкость", "увлечённость", "возбуждение", "волнение", "восторг", "горячность",
                "душевный подъем", "порыв", "эйфория", "жар", "жгучесть", "живость", "задор", "интерес", "лихость",
                "огонь", "одержимость", "остервенение", "пламя", "пламенность", "полет", "помешанность",
                "приподнятость", "пристрастие", "проворство", "прыть", "пыл", "пылкость", "рвение", "решимость",
                "страстность", "страсть", "усердие", "экстаз"
            ]
        }
    };

    private readonly int _minimalWordLength;

    public ChancelleryDetector()
    {
        _minimalWordLength =
            _dictionary.Keys.Select(x => x.Length).Min() - 2; // Вычитаем 2 символа чтобы учесть слова с ошибками
    }

    public DetectResult DetectSingle(string word)
    {
        if (string.IsNullOrEmpty(word) || word.Length < _minimalWordLength)
            return DetectResult.NotMatch;

        var wordLower = word.ToLowerInvariant();
        if (_dictionary.TryGetValue(wordLower, out var synonyms))
            return CreateResult(synonyms);

        var findResult = _dictionary.Keys
            .ToDictionary(x => x, x => Fuzz.PartialRatio(wordLower, x))
            .MaxBy(x => x.Value);
        if (findResult.Value < 80 || !findResult.Key.CheckSimilarityByLength(wordLower)
                                  || !_dictionary.TryGetValue(findResult.Key, out synonyms))
            return DetectResult.NotMatch;


        return CreateResult(synonyms);
    }

    public DetectResult[] DetectAll(string text) => [];

    private static DetectResult CreateResult(string[] synonyms) => new()
    {
        Name = _name,
        Description = string.Format(_description, string.Join(",", synonyms)),
        ShortDescription = _shortDescription,
        Color = _color,
        Tab = _tab,
        Weight = _weight
    };
}