using JuTCo.Text.Review.Contracts;

namespace JuTCo.Text.Review.Detectors;

/// <summary>
///     Детектор штампов и клише
/// </summary>
internal class StampClicheDetector : IDetector
{
    private const int _weight = 45;
    private const string _name = "Штампы и клише";

    private const string _description =
        "Штампы и клише - это шаблонные выражения, которые всем надоели так как используются повсеместно и всем надоели. Так же это еще называют «словесный мусор». Попробуйте заменить или перефразировать, если данная фраза не обязательна для передачи смысла";

    private const string _shortDescription = "Эти фразы портят текст так как уже надоели";
    private const string _color = "blue";
    private const string _tab = "blue";

    private static readonly string[] _clicheAndStamps =
    [
        "самый широкий спектр",
        "оптимальный выбор",
        "особой популярностью пользуются",
        "пользуются особой популярностью",
        "их отличительной особенностью является",
        "является их отличительной особенностью",
        "разнообразие цветовых решений",
        "разнообразие решений",
        "отличается экологичностью",
        "отличается универсальностью",
        "цены приятно удивят",
        "у нас работают профессионалы своего дела",
        "принять соответствующие меры",
        "на сегодняшний день",
        "одна из наиболее востребованных",
        "индивидуальный подход",
        "общеизвестно, что",
        "общеизвестно что",
        "ни для кого не секрет",
        "по праву считается",
        "широкий ассортимент",
        "широкий выбор",
        "непревзойденное качество",
        "высокий профессиональный уровень",
        "гарантированный результат",
        "квалифицированная помощь",
        "команда профессионалов",
        "в кратчайшие сроки",
        "если вас интересует",
        "по этой причине",
        "в последнее время",
        "в настоящее время",
        "основной плюс использования",
        "экологичные материалы",
        "вы можете купить",
        "в каталоге представлены различные",
        "в репозитории представлены различные",
        "важным моментом является",
        "стоит подойти со всей ответственностью и серьезностью",
        "обратите внимание на следующие моменты",
        "стоит отметить, что",
        "стоит отметить что",
        "стоит понимать, что",
        "стоит понимать что",
        "в подобных случаях обязательно необходимо",
        "какими преимуществами и особенностями они обладают",
        "осуществлением такого вида услуг",
        "подчеркнет индивидуальность",
        "представляет собой",
        "сэкономит ваше время, нервы и деньги",
        "по телефону, указанному на сайте",
        "мы используем современные технологии",
        "исходя из личных предпочтений",
        "на любой вкус и кошелек",
        "на любой вкус и цвет",
        "не отходя от компьютера",
        "не вставая с дивана",
        "продукт высокого качества",
        "по оптимальной цене",
        "с учетом всех пожеланий клиента",
        "обратиться к опытным профессионалам",
        "давно стали неотъемлемой составляющей жизни современного человека",
        "по демократичным ценам",
        "обратившись к нам, вы можете быть уверены",
        "с указанием стоимости и сроков оказываемых услуг",
        "в соответствующем разделе",
        "не лишним будет",
        "никого не оставляют равнодушным",
        "и это не удивительно",
        "вовсе не странно, что",
        "представлена информация",
        "интуитивно понятный интерфейс",
        "предлагаем качественный сервис",
        "достаточно лишь зайти на сайт, выбрать товар и оформить заказ",
        "высокое качество приобретаемых товаров",
        "примите во внимание предоставленную нами информацию",
        "наша компания предлагает вам",
        "наша команда предлагает вам",
        "наш менеджер свяжется с вами в любое удобное время",
        "получить исчерпывающую информацию",
        "показать свой высокий социальный статус",
        "обращать пристальное внимание",
        "несколько основных критериев",
        "достаточно задать в поисковике",
        "достаточно задать в поиске",
        "того, что подойдет конкретно вам",
        "привлекает с каждым годом все больше",
        "наиболее предпочтительным вариантом",
        "бюджетной стоимостью",
        "не составит большого труда",
        "сегодня совсем не сложно",
        "длительный срок эксплуатации",
        "получите бесплатную консультацию",
        "на выгодных условиях приобрести",
        "является ответственным и серьезным шагом",
        "вниманию покупателей предлагаются",
        "неотъемлемый атрибут",
        "неотъемлемой частью",
        "неотъемлемая часть",
        "таким образом",
        "должное качество",
        "выйти на должный уровень",
        "можно сделать вывод, что",
        "можно сделать вывод что",
        "примите во внимание рекомендации",
        "наши сотрудники – профессионалы своего дела",
        "наши сотрудники профессионалы своего дела",
        "имеется большое количество вариантов, значений, среди которых каждый подберет для себя оптимальный исходя из",
        "менеджеры с радостью проконсультируют и ответят на все ваши вопросы",
        "специалисты с радостью проконсультируют и ответят на все ваши вопросы",
        "пески времени",
        "в лучших традициях",
        "царила атмосфера",
        "ударными темпами",
        "шаг за шагом",
        "мало‑помалу",
        "так или иначе",
        "сплошь и рядом",
        "направо и налево",
        "авоевать доверие клиентов",
        "решать задачи бизнеса",
        "расширить географию продаж"
        
    ];

    private readonly int _minimalPhraseLength;

    public StampClicheDetector()
    {
        _minimalPhraseLength = _clicheAndStamps.Select(x => x.Length).Min();
    }

    public DetectResult DetectSingle(string word) => DetectResult.NotMatch;

    public DetectResult[] DetectAll(string text)
    {
        if (string.IsNullOrWhiteSpace(text) || text.Length < _minimalPhraseLength)
            return [];

        var result = new List<DetectResult>();
        foreach (var phrase in _clicheAndStamps)
        {
            var index = text.IndexOf(phrase, StringComparison.OrdinalIgnoreCase);
            if (index == -1)
                continue;
            result.Add(new DetectResult()
            {
                Start = index,
                End = index + phrase.Length,
                Name = _name,
                Description = _description,
                ShortDescription = _shortDescription,
                Color = _color,
                Tab = _tab,
                Weight = _weight
            });
        }

        return result.ToArray();
    }
}